SERVICES = {
    "1": {
        "name": "حكومي",
        "display_msg": """
🏛️ *دليلك للخدمات والدوائر الحكومية في القرين:*

🏢 *أمارة مركز القرين:*  
📞 0162332212

🏥 *مركز صحي القرين:*  
📞 0162332232

🚓 *شرطة القرين:*  
📞 0162332281

🏫 *مدرسة الابتدائية الأولى – بنين:*  
📞 0162332001

🏫 *مدرسة الثانوية – بنين:*  
📞 0165322556

🕌 *مكتب الدعوة والإرشاد وتوعية الجاليات:*  
📞 0162332147

🤝 *الجمعية الخيرية:*  
📞 0533399840

━━━━━━━━━━━━━━━  
📲 *أرقام الطوارئ والخدمات العامة:*

🚑 997 — الإسعاف  
🔥 998 — الدفاع المدني  
🚓 999 — الشرطة  
🚗 993 — المرور  
🚧 996 — أمن الطرق  
💡 933 — شركة الكهرباء  
🩺 937 — وزارة الصحة  
📄 920000560 — نجم (حوادث المركبات المؤمن عليها)

━━━━━━━━━━━━━━━ 
🔄 أرسل 0 للعودة للقائمة الرئيسية  

📅 *آخر تحديث: أغسطس 2025*
""",
        "items": [
            {"name": "أمارة مركز القرين", "phone": "0162332212"},
            {"name": "مركز صحي القرين", "phone": "0162332232"},
            {"name": "شرطة القرين", "phone": "0162332281"},
            {"name": "مدرسة الابتدائية الأولى – بنين", "phone": "0162332001"},
            {"name": "مدرسة الثانوية – بنين", "phone": "0165322556"},
            {"name": "مكتب الدعوة والإرشاد وتوعية الجاليات", "phone": "0162332147"},
            {"name": "الجمعية الخيرية", "phone": "0533399840"},
        ],
        "emergency": [
            {"name": "الإسعاف", "phone": "997"},
            {"name": "الدفاع المدني", "phone": "998"},
            {"name": "الشرطة", "phone": "999"},
            {"name": "المرور", "phone": "993"},
            {"name": "أمن الطرق", "phone": "996"},
            {"name": "شركة الكهرباء", "phone": "933"},
            {"name": "وزارة الصحة", "phone": "937"},
            {"name": "نجم (حوادث المركبات المؤمن عليها)", "phone": "920000560"}
        ]
    },
    "2": {
        "name": "صيدلية",
        "display_msg": """
💊 [2] قائمة الصيدليات في القرين والدليمية:

🏪 صيدلية ركن أطلس (📍القرين)
📞 0556945390
📍 https://maps.app.goo.gl/4YLktrjdi5VFqMGHA
🕒 أوقات الدوام:
🕗 من 7 صباحاً إلى 3 صباحاً
🕌 الجمعة: من 3 عصراً إلى 3 صباحاً
💡 خدمة وصفتي متوفرة

━━━━━━━━━━━━━━━

🏪 صيدلية نواظر (📍الدليمية)
📞 0539550444
📍 https://maps.app.goo.gl/2rLyro4cgdWcMV2T9
🕒 أوقات الدوام:
🕘 24 ساعة طوال أيام الأسبوع

━━━━━━━━━━━━━━━

🏪 صيدلية دواء البدر (📍الدليمية)
📞 0162339000
📍 https://maps.app.goo.gl/oj8w9dBUTdjmbW4z8
🕒 أوقات الدوام:
🕘 من 9 صباحاً إلى 1 صباحاً
🕌 الجمعة: من 4 عصراً إلى 1 صباحاً

━━━━━━━━━━━━━━━
🔄 أرسل 0 للعودة إلى القائمة الرئيسية
📅 آخر تحديث: أغسطس 2025
""",
        "items": [
            {
                "name": "صيدلية ركن أطلس",
                "branch": "القرين",
                "phone": "0556945390",
                "map": "https://maps.app.goo.gl/4YLktrjdi5VFqMGHA",
                "work_time": "من 7 صباحاً إلى 3 صباحاً (الجمعة: من 3 عصراً إلى 3 صباحاً)",
                "extra": "خدمة وصفتي متوفرة"
            },
            {
                "name": "صيدلية نواظر",
                "branch": "الدليمية",
                "phone": "0539550444",
                "map": "https://maps.app.goo.gl/2rLyro4cgdWcMV2T9",
                "work_time": "24 ساعة طوال أيام الأسبوع"
            },
            {
                "name": "صيدلية دواء البدر",
                "branch": "الدليمية",
                "phone": "0162339000",
                "map": "https://maps.app.goo.gl/oj8w9dBUTdjmbW4z8",
                "work_time": "من 9 صباحاً إلى 1 صباحاً (الجمعة: من 4 عصراً إلى 1 صباحاً)"
            }
        ]
    },
    "3": {
        "name": "بقالة",
        "display_msg": """🥤 [3] قائمة البقالات :

🛒 بقالة سلة سلطانة
📞 +966509007300
📍 https://maps.app.goo.gl/5VXuKAwCn4NzuiVYA

━━━━━━━━━━━━━━━

🛒 بقالة ركن قريتي
📞 +966537081794
📍 https://maps.app.goo.gl/xR8kU4E3PDw32jeu5

━━━━━━━━━━━━━━━

🛒 بقالة شموع الوسام
📞 0539881727
📍 https://maps.app.goo.gl/VEnZ7bPQeJvDawTA6

━━━━━━━━━━━━━━━

⛽ محطة صالح
📞 0554181777
📍 https://maps.app.goo.gl/i25nbWM1xycNBKkj7

━━━━━━━━━━━━━━━

⛽ محطة بابل
📞 0559513561
📍 https://maps.app.goo.gl/8jtpoNzBVt6hr36v9

━━━━━━━━━━━━━━━

🎒 لوازم رحلات:

🧺 محل ركن الوسم
📞 0530165380
📍 https://maps.app.goo.gl/yNBoArtpAJa3JvR77

🧺 محل صندوق الرحلة
📞 0506438303
📍 https://maps.app.goo.gl/8Ze2w48KZnKnMZP26

━━━━━━━━━━━━━━━
🔄 أرسل 0 للعودة إلى القائمة الرئيسية
📅 آخر تحديث: أغسطس 2025
""",
        "items": [
            {
                "name": "بقالة سلة سلطانة",
                "phone": "+966509007300",
                "map": "https://maps.app.goo.gl/5VXuKAwCn4NzuiVYA"
            },
            {
                "name": "بقالة ركن قريتي",
                "phone": "+966537081794",
                "map": "https://maps.app.goo.gl/xR8kU4E3PDw32jeu5"
            },
            {
                "name": "بقالة شموع الوسام",
                "phone": "0539881727",
                "map": "https://maps.app.goo.gl/VEnZ7bPQeJvDawTA6"
            },
            {
                "name": "محطة صالح",
                "phone": "0554181777",
                "map": "https://maps.app.goo.gl/i25nbWM1xycNBKkj7"
            },
            {
                "name": "محطة بابل",
                "phone": "0559513561",
                "map": "https://maps.app.goo.gl/8jtpoNzBVt6hr36v9"
            },
            {
                "name": "محل ركن الوسم",
                "phone": "0530165380",
                "map": "https://maps.app.goo.gl/yNBoArtpAJa3JvR77"
            },
            {
                "name": "محل صندوق الرحلة",
                "phone": "0506438303",
                "map": "https://maps.app.goo.gl/8Ze2w48KZnKnMZP26"
            }
        ]
    },
    "4": {
        "name": "خضار",
        "items": [
            # {"name": "خضار الطازج", "phone": "0500000002"},
        ]
    },
    "5": {
        "name": "حلا وأسر منتجة",
        "items": [
            # {"name": "حلويات القمة", "phone": "0500000003"},
        ]
    },
    "6": {
    "name": "مطاعم",
    "display_msg": """
━━━━━━━━━━━━━━━━━━━
🍽️ دليلك للمطاعم والوجبات السريعة في القرين
━━━━━━━━━━━━━━━━━━━

━━━━━━━━━━━━━━━
🍛 ——— المطاعم ——— 🍛
━━━━━━━━━━━━━━━

🍴 مطعم لقمة سحاب
📞 0536777194
📍 https://maps.app.goo.gl/XcZWVeTQCt46BcWdA

🍴 مطعم المدينة
📞 0532834828
📍 https://maps.app.goo.gl/iud8ZDgLRnqvwM99A

🍴 مطعم غاية الرومنسية (الدليمية)
📞 0162331234
📍 https://maps.app.goo.gl/FG7JDNxYHKVvJCnh9

━━━━━━━━━━━━━━━
🍔 ——— الوجبات السريعة ——— 🍔
━━━━━━━━━━━━━━━

🥪 بوفيه ورد هناء عدن
📞 0557838324
📍 https://maps.app.goo.gl/mDjCRKZzii5xhuga6

🥪 بوفية برنس الديرة
📞 0508206110
📍 https://maps.app.goo.gl/v2FtTaNuCCrSArZC8

🍕 مطعم زاوية الراقي
📞 0543053031
📍 https://maps.app.goo.gl/BV9EkxF3TDebwyRb9

🍔 بارت برقر (الدليمية)
📞 0537711667
📍 https://maps.app.goo.gl/UeqjLncboUgf9dgXA

🔥 على الجمر (الدليمية)
📞 0558881336
📍 https://maps.app.goo.gl/DKmFWn9HMpcEsWLv9

🌯 الذوق العالمي
📞 0557322371
📍 https://maps.app.goo.gl/9Sih7g9WiJivzFJJ8

🍗 البيت الدمشقي
📞 0552331616
📍 https://maps.app.goo.gl/mJcVfDv6osxmYaAC6

🥟 رقائق العجينة (الدليمية)
📞 0558141818
📍 https://maps.app.goo.gl/47QDiybQdU6UGTdY9

🥮 الفطيرة الشرقية (الدليمية)
📞 0162331919
📍 https://maps.app.goo.gl/iikfvTpwKvcKeXw68

🍗 كتكوت الطازج (الدليمية)
📞 0578004950
📍 https://maps.app.goo.gl/YhdXGH2tT9wq62Jx5

━━━━━━━━━━━━━━━
🍖 ——— المطابخ ——— 🍖
━━━━━━━━━━━━━━━

🥘 مطبخ ذبايح منصور (أبو أيوب)
📞 0503973617
📍 https://maps.app.goo.gl/9rLpqgfKR4eUdryG9

🥘 الطبق النجدي
📞 0530353557
📍 https://maps.app.goo.gl/fhiHgwJguq1dBtS8A

🥘 مطبخ الخالدية
📞 0533421042
📍 https://maps.app.goo.gl/ffmXstVj6MND5A6z5

🥘 مطبخ شيف الديرة (أبو تركي)
📞 0509097563
📍 https://maps.app.goo.gl/bresRMFvSxvQ1GM98

━━━━━━━━━━━━━━━━━━━
🔄 أرسل 0 للعودة للقائمة الرئيسية
📅 آخر تحديث: أغسطس 2025
""",
    "items": [
        # المطاعم
        {"name": "مطعم لقمة سحاب", "phone": "0536777194", "map": "https://maps.app.goo.gl/XcZWVeTQCt46BcWdA"},
        {"name": "مطعم المدينة", "phone": "0532834828", "map": "https://maps.app.goo.gl/iud8ZDgLRnqvwM99A"},
        {"name": "مطعم غاية الرومنسية (الدليمية)", "phone": "0162331234", "map": "https://maps.app.goo.gl/FG7JDNxYHKVvJCnh9"},
        # الوجبات السريعة
        {"name": "بوفيه ورد هناء عدن", "phone": "0557838324", "map": "https://maps.app.goo.gl/mDjCRKZzii5xhuga6"},
        {"name": "بوفية برنس الديرة", "phone": "0508206110", "map": "https://maps.app.goo.gl/v2FtTaNuCCrSArZC8"},
        {"name": "مطعم زاوية الراقي", "phone": "0543053031", "map": "https://maps.app.goo.gl/BV9EkxF3TDebwyRb9"},
        {"name": "بارت برقر (الدليمية)", "phone": "0537711667", "map": "https://maps.app.goo.gl/UeqjLncboUgf9dgXA"},
        {"name": "على الجمر (الدليمية)", "phone": "0558881336", "map": "https://maps.app.goo.gl/DKmFWn9HMpcEsWLv9"},
        {"name": "الذوق العالمي", "phone": "0557322371", "map": "https://maps.app.goo.gl/9Sih7g9WiJivzFJJ8"},
        {"name": "البيت الدمشقي", "phone": "0552331616", "map": "https://maps.app.goo.gl/mJcVfDv6osxmYaAC6"},
        {"name": "رقائق العجينة (الدليمية)", "phone": "0558141818", "map": "https://maps.app.goo.gl/47QDiybQdU6UGTdY9"},
        {"name": "الفطيرة الشرقية (الدليمية)", "phone": "0162331919", "map": "https://maps.app.goo.gl/iikfvTpwKvcKeXw68"},
        {"name": "كتكوت الطازج (الدليمية)", "phone": "0578004950", "map": "https://maps.app.goo.gl/YhdXGH2tT9wq62Jx5"},
        # المطابخ
        {"name": "مطبخ ذبايح منصور (أبو أيوب)", "phone": "0503973617", "map": "https://maps.app.goo.gl/9rLpqgfKR4eUdryG9"},
        {"name": "الطبق النجدي", "phone": "0530353557", "map": "https://maps.app.goo.gl/fhiHgwJguq1dBtS8A"},
        {"name": "مطبخ الخالدية", "phone": "0533421042", "map": "https://maps.app.goo.gl/ffmXstVj6MND5A6z5"},
        {"name": "مطبخ شيف الديرة (أبو تركي)", "phone": "0509097563", "map": "https://maps.app.goo.gl/bresRMFvSxvQ1GM98"},
    ]
},
    "7": {
        "name": "محلات",
        "items": [
            # {"name": "محل السيف", "phone": "0500000005"},
        ]
    },
    "8": {
    "name": "شالية",
    "display_msg": """
━━━━━━━━━━━━━━━━━━━
🏨 دليلك للشاليهات والاستراحات وقاعات المناسبات في القرين
━━━━━━━━━━━━━━━━━━━

━━━━━━━━━━━━━━━
🎉 ——— القاعات وقصور الاحتفالات ———
━━━━━━━━━━━━━━━

💒 قصر القرين للإحتفالات
📞 0508009954
📍 https://maps.app.goo.gl/G92q1VLsw5PWqqz39

💒 قاعة العائلة (الحسين)
📞 0503141604
📍 https://maps.app.goo.gl/ta5UBuPuESHodGjV8

💒 قاعة الأفق
📞 0555133902
📍 https://maps.app.goo.gl/YTnnGxZR8ZNbjrzc8

💒 قصر السلام
📞 0551350490
📍 https://maps.app.goo.gl/Bzj14YB2qkJW2btPA

💒 استراحة الأسرة
📞 0576352699
📍 https://maps.app.goo.gl/WBuc7deMbxcK5NAg8

━━━━━━━━━━━━━━━
🌴 ——— الشاليهات والمنتجعات ———
━━━━━━━━━━━━━━━

🏝️ شالية لانسي
📞 0555409795
📍 https://maps.app.goo.gl/1yqgq2qmvAuy8fPf9

🏝️ شالية بيلا
📞 0502284499
📍 https://maps.app.goo.gl/3h8tqbneDnjj5UmAA

🏝️ شالية أوكلاند
📞 0536652013
📍 https://maps.app.goo.gl/iryQmrSVpkjoWUfr9

🏝️ شالية فنو
📞 0504892347
📍 https://maps.app.goo.gl/HrN4ph7W7Rnnouq47

🏝️ شالية رودينا
📞 0504898642 – 0540615659 – 0558054912
📍 https://maps.app.goo.gl/2meJanF8z8yd1AR66

🏝️ شالية ميرا
📞 0531205601
📍 https://maps.app.goo.gl/i4KGaRG5GwyfzXHy9

🏝️ شالية HR
📞 0502350572
📍 https://maps.app.goo.gl/oUqTSfJgLVCpC5ac8

🏝️ شالية الضويحيات
📞 0544227716
📍 https://maps.app.goo.gl/MHLnHhiy167ukgAU7

🏝️ شالية التركي
📞 0555171778
📍 https://maps.app.goo.gl/WrnxKw48ayAS9RWi9

🏝️ شالية لمار
📞 0537932557
📍 https://maps.app.goo.gl/hiJAQvcX3ZwoucQR6

🏝️ شالية ألوان
📞 0555372729
📍 https://maps.app.goo.gl/MfXPGDZ9kJ3K1cKdA

🏝️ منتجع غنى
📞 0532760400
📍 https://maps.app.goo.gl/h54d7KU18X7dLrr96

🏝️ منتجع الريف
📞 0507473077
📍 https://maps.app.goo.gl/WuTDVRpMJxfyD7ni9

🏝️ منتجع النخيل
📞 0507862221
📍 https://maps.app.goo.gl/fQ35here4Z8Jh5sv8

━━━━━━━━━━━━━━━
🏕️ ——— الاستراحات ———
━━━━━━━━━━━━━━━

🏕️ استراحة الأثير
📞 0540615659
📍 https://maps.app.goo.gl/ELU5omRUnBkLZqwr6

🏕️ استراحة البرج
📞 0591584142
📍 https://maps.app.goo.gl/zKjTie3r9isLsara8

🏕️ استراحة الجود
📞 0531412999 – 0559517354
📍 https://maps.app.goo.gl/ih7uDnBpvpA5FFG27

🏕️ استراحة الريف
📞 0532760882
📍 https://maps.app.goo.gl/EoLZVHGyGpJRKP9j9

🏕️ استراحة سُجى
📞 0506125242
📍 https://maps.app.goo.gl/tisxwEtTwRpR3Hgm6

🏕️ استراحة الأمجاد
📞 0559400810
📍 https://maps.app.goo.gl/vMTU1dro1BAvwdEs9

🏕️ استراحة الشمال
📞 0554953655
📍 https://maps.app.goo.gl/R6jzpqMpHjsJCExYA

━━━━━━━━━━━━━━━
🐎 ——— الاسطبلات ———
━━━━━━━━━━━━━━━

🐎 مربط عز النوايف
📞 0590040034
📍 https://maps.app.goo.gl/VCbFDuSg4sBijTdn7

🐎 اسطبل الشفاء
📞 0559997770
📍 https://maps.app.goo.gl/rMyYfozJLiyA1zAg9

━━━━━━━━━━━━━━━━━━━
🔄 أرسل 0 للعودة للقائمة الرئيسية
📅 آخر تحديث: أغسطس 2025
━━━━━━━━━━━━━━━━━━━
""",
    "items": [
        # القاعات
        {"name": "قصر القرين للإحتفالات", "phone": "0508009954", "map": "https://maps.app.goo.gl/G92q1VLsw5PWqqz39"},
        {"name": "قاعة العائلة (الحسين)", "phone": "0503141604", "map": "https://maps.app.goo.gl/ta5UBuPuESHodGjV8"},
        {"name": "قاعة الأفق", "phone": "0555133902", "map": "https://maps.app.goo.gl/YTnnGxZR8ZNbjrzc8"},
        {"name": "قصر السلام", "phone": "0551350490", "map": "https://maps.app.goo.gl/Bzj14YB2qkJW2btPA"},
        {"name": "استراحة الأسرة", "phone": "0576352699", "map": "https://maps.app.goo.gl/WBuc7deMbxcK5NAg8"},
        # الشاليهات
        {"name": "شالية لانسي", "phone": "0555409795", "map": "https://maps.app.goo.gl/1yqgq2qmvAuy8fPf9"},
        {"name": "شالية بيلا", "phone": "0502284499", "map": "https://maps.app.goo.gl/3h8tqbneDnjj5UmAA"},
        {"name": "شالية أوكلاند", "phone": "0536652013", "map": "https://maps.app.goo.gl/iryQmrSVpkjoWUfr9"},
        {"name": "شالية فنو", "phone": "0504892347", "map": "https://maps.app.goo.gl/HrN4ph7W7Rnnouq47"},
        {"name": "شالية رودينا", "phone": "0504898642 – 0540615659 – 0558054912", "map": "https://maps.app.goo.gl/2meJanF8z8yd1AR66"},
        {"name": "شالية ميرا", "phone": "0531205601", "map": "https://maps.app.goo.gl/i4KGaRG5GwyfzXHy9"},
        {"name": "شالية HR", "phone": "0502350572", "map": "https://maps.app.goo.gl/oUqTSfJgLVCpC5ac8"},
        {"name": "شالية الضويحيات", "phone": "0544227716", "map": "https://maps.app.goo.gl/MHLnHhiy167ukgAU7"},
        {"name": "شالية التركي", "phone": "0555171778", "map": "https://maps.app.goo.gl/WrnxKw48ayAS9RWi9"},
        {"name": "شالية لمار", "phone": "0537932557", "map": "https://maps.app.goo.gl/hiJAQvcX3ZwoucQR6"},
        {"name": "شالية ألوان", "phone": "0555372729", "map": "https://maps.app.goo.gl/MfXPGDZ9kJ3K1cKdA"},
        {"name": "منتجع غنى", "phone": "0532760400", "map": "https://maps.app.goo.gl/h54d7KU18X7dLrr96"},
        {"name": "منتجع الريف", "phone": "0507473077", "map": "https://maps.app.goo.gl/WuTDVRpMJxfyD7ni9"},
        {"name": "منتجع النخيل", "phone": "0507862221", "map": "https://maps.app.goo.gl/fQ35here4Z8Jh5sv8"},
        # الاستراحات
        {"name": "استراحة الأثير", "phone": "0540615659", "map": "https://maps.app.goo.gl/ELU5omRUnBkLZqwr6"},
        {"name": "استراحة البرج", "phone": "0591584142", "map": "https://maps.app.goo.gl/zKjTie3r9isLsara8"},
        {"name": "استراحة الجود", "phone": "0531412999 – 0559517354", "map": "https://maps.app.goo.gl/ih7uDnBpvpA5FFG27"},
        {"name": "استراحة الريف", "phone": "0532760882", "map": "https://maps.app.goo.gl/EoLZVHGyGpJRKP9j9"},
        {"name": "استراحة سُجى", "phone": "0506125242", "map": "https://maps.app.goo.gl/tisxwEtTwRpR3Hgm6"},
        {"name": "استراحة الأمجاد", "phone": "0559400810", "map": "https://maps.app.goo.gl/vMTU1dro1BAvwdEs9"},
        {"name": "استراحة الشمال", "phone": "0554953655", "map": "https://maps.app.goo.gl/R6jzpqMpHjsJCExYA"},
        # الاسطبلات
        {"name": "مربط عز النوايف", "phone": "0590040034", "map": "https://maps.app.goo.gl/VCbFDuSg4sBijTdn7"},
        {"name": "اسطبل الشفاء", "phone": "0559997770", "map": "https://maps.app.goo.gl/rMyYfozJLiyA1zAg9"},
    ]
},
    "9": {
        "name": "وايت",
        "items": [
            # {"name": "وايت المياه", "phone": "0500000007"},
        ]
    },
    "10": {
        "name": "شيول. دفان ومواد بناء",
        "items": [
            # {"name": "مؤسسة البناء", "phone": "0500000008"},
        ]
    },
    "11": {
        "name": "عمال",
        "sub_services": {
            # أمثلة (أضف خدمات فرعية مثل سباكين، كهربائيين، الخ):
            # "1": {
            #     "name": "سباكين",
            #     "items": [
            #         {"name": "أبو سيف", "phone": "0500000010"},
            #         {"name": "أبو خالد", "phone": "0500000011"}
            #     ]
            # },
        }
    },
    "12": {
        "name": "محلات مهنية",
        "items": [
            # {"name": "مغسلة ملابس", "phone": "0500000009"},
        ]
    },
    "13": {
        "name": "ذبائح وملاحم",
        "items": [
            # {"name": "ملحمة أبو وليد", "phone": "0500000012"},
        ]
    },
    "14": {
        "name": "نقل مدرسي ومشاوير",
        "items": [
            # {"name": "نقل الطلاب", "phone": "0500000013"},
        ]
    },
    "15": {
        "name": "تأجير",
        "items": [
            # {"name": "تأجير سيارات", "phone": "0500000014"},
        ]
    }
}
